addbooking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addBookingRequest>
            <gs:roomNumber>102</gs:roomNumber>
            <gs:startDate>2025-05-11</gs:startDate>
            <gs:endDate>2025-05-12</gs:endDate>
        </gs:addBookingRequest>
    </soapenv:Body>
</soapenv:Envelope>